IDEA StatiCa Open Model
RebarSegment3DArc3Pts Class
Compatible with IDEA StatiCa Beta 21.0 - beta
 Represents an arc segment in 3D space defined by 3 points Start, End and a Point between start and end point.
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.Model.RebarSegment3DBase
 IdeaRS.OpenModel.Model.RebarSegment3DArc3Pts
 Namespace: IdeaRS.OpenModel.Model
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public class RebarSegment3DArc3Pts : RebarSegment3DBase
Public Class RebarSegment3DArc3Pts
	Inherits RebarSegment3DBase
public ref class RebarSegment3DArc3Pts : public RebarSegment3DBase
The RebarSegment3DArc3Pts type exposes the following members.
Constructors
Name | Description
RebarSegment3DArc3Pts
Initializes a new instance of the RebarSegment3DArc3Pts class
Top
Properties
Name | Description
EndPoint
 Gets or sets the endpoint of the segment.
 (Inherited from RebarSegment3DBase.)
ThirdPoint
 Gets or sets the point of circular arc somewhere between start and end point.
Top
See Also
Reference
IdeaRS.OpenModel.Model Namespace